       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA02
      *==============================
      *======= AUTOR: CAMILA     EMPRESA: XPTO
      *======= OBJETIVO: 1. CONTATO COM COBOL
      *======= DATA: 15/02/2025
      *======= OBSERVAÇÕES:
      *==============================
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       0002-MAIN-PROCEDURE SECTION.
            DISPLAY "Hello word"
       0001-MOVE SECTION
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
