        IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULO-SALARIO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-SALARIO-BRUTO     PIC 9(06)V99 VALUE ZEROS.
       77 WRK-IR                PIC 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-FINAL     PIC 9(06)V99 VALUE ZEROS.

       77 WRK-SALARIO-BRUTO-ED  PIC ZZ.ZZZ,99.
       77 WRK-IR-ED             PIC ZZ.ZZZ,99.
       77 WRK-SALARIO-FINAL-ED  PIC ZZ.ZZZ,99.

       PROCEDURE DIVISION.
       0100-RECEBE SECTION.

       DISPLAY "DIGITE O SALARIO BRUTO: ".
       ACCEPT WRK-SALARIO-BRUTO.

       0150-CALCULA SECTION.

       IF WRK-SALARIO-BRUTO >= 1000
           COMPUTE WRK-IR = WRK-SALARIO-BRUTO * 0,15
       ELSE
           COMPUTE WRK-IR = WRK-SALARIO-BRUTO * 0,10
       END-IF.

       COMPUTE WRK-SALARIO-FINAL = WRK-SALARIO-BRUTO - WRK-IR.

       MOVE WRK-SALARIO-BRUTO TO WRK-SALARIO-BRUTO-ED.
       MOVE WRK-IR TO WRK-IR-ED.
       MOVE WRK-SALARIO-FINAL TO WRK-SALARIO-FINAL-ED.

       0200-MOSTRA SECTION.
       DISPLAY "SALARIO BRUTO : " WRK-SALARIO-BRUTO-ED.
       DISPLAY "IR : " WRK-IR-ED.
       DISPLAY "SALARIO FINAL : " WRK-SALARIO-FINAL-ED.

       0300-FINALIZA SECTION.
       STOP RUN.
