       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULO-VIAGEM.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 WRK-PASSAGEIRO        PIC X(30)    VALUE SPACES.
       77 WRK-DESTINO           PIC X(15)    VALUE SPACES.
       77 WRK-VALOR-COMBUSTIVEL PIC 9(03)V99 VALUE ZEROS.
       77 WRK-CUSTO-POR-KM      PIC 9(03)V99 VALUE ZEROS.
       77 WRK-DISTANCIA         PIC 9(03)    VALUE ZEROS.
       77 WRK-VALOR-VIAGEM      PIC 9(06)V99 VALUE ZEROS.

       77 WRK-VALOR-VIAGEM-ED   PIC ZZ.ZZZ,99.

       PROCEDURE DIVISION.
       0100-RECEBE SECTION.

       DISPLAY "NOME DO PASSAGEIRO: ".
       ACCEPT WRK-PASSAGEIRO.

       DISPLAY "DESTINO (Piracicaba/Campinas/Jundiai): ".
       ACCEPT WRK-DESTINO.

       DISPLAY "VALOR DO LITRO DO COMBUSTIVEL: ".
       ACCEPT WRK-VALOR-COMBUSTIVEL.

       COMPUTE WRK-CUSTO-POR-KM = WRK-VALOR-COMBUSTIVEL / 10.

       0150-CALCULA SECTION.

       EVALUATE WRK-DESTINO
           WHEN "Piracicaba"
               MOVE 220 TO WRK-DISTANCIA
           WHEN "Campinas"
               MOVE 180 TO WRK-DISTANCIA
           WHEN "Jundiai"
               MOVE 120 TO WRK-DISTANCIA
           WHEN OTHER
               DISPLAY "DESTINO INVALIDO"
               STOP RUN
       END-EVALUATE.

       COMPUTE WRK-VALOR-VIAGEM = (WRK-DISTANCIA * WRK-CUSTO-POR-KM) * 1.30.

       MOVE WRK-VALOR-VIAGEM TO WRK-VALOR-VIAGEM-ED.

       0200-MOSTRA SECTION.
       DISPLAY "PASSAGEIRO: " WRK-PASSAGEIRO.
       DISPLAY "DESTINO: " WRK-DESTINO.
       DISPLAY "VALOR DA VIAGEM: " WRK-VALOR-VIAGEM-ED.

       0300-FINALIZA SECTION.
       STOP RUN.
