IDENTIFICATION DIVISION.
       PROGRAM-ID. OPERADORES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WRK-SALARIO      PIC 9(05)V99.
           01 WRK-FALTAS       PIC 9(02).
           01 WRK-SALARIO-NOVO PIC 9(06)V99.

       PROCEDURE DIVISION.
           DISPLAY "SALARIO "
              ACCEPT WRK-SALARIO
           DISPLAY "FALTAS NO MES "
              ACCEPT WRK-FALTAS.

           IF (WRK-SALARIO LESS THAN OR EQUAL 2000) AND
           (WRK-FALTAS EQUAL 0)
              COMPUTE WRK-SALARIO-NOVO = WRK-SALARIO *1.10

           ELSE
               COMPUTE WRK-SALARIO-NOVO = WRK-SALARIO


               END-IF.
           DISPLAY "SALARIO ATUALIZADO" WRK-SALARIO-NOVO.



           STOP RUN.
