IDENTIFICATION DIVISION.
       PROGRAM-ID. VETORES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WRK-NOTAS.
           02 WRK-NOTA  PIC 9(02)V99 OCCURS 04 TIMES.

       01  WRK-MEDIA    PIC 9(02)V99 VALUE ZEROS.
       01  WRK-ITEM     PIC 9        VALUE ZEROS.

       PROCEDURE DIVISION.

       PERFORM VARYING WRK-ITEM FROM 1 BY 1 UNTIL WRK-ITEM GREATER 4
            DISPLAY "DIGITE NOTA " WRK-ITEM
                  ACCEPT WRK-NOTA (WRK-ITEM)
       END-PERFORM.

       PERFORM VARYING WRK-ITEM FROM 1 BY 1 UNTIL WRK-ITEM GREATER 4
            DISPLAY "NOTA " WRK-ITEM " = " WRK-NOTA(WRK-ITEM)
           COMPUTE WRK-MEDIA = WRK-MEDIA + WRK-NOTA(WRK-ITEM)
       END-PERFORM.

           COMPUTE WRK-MEDIA  = WRK-MEDIA / 4.
            DISPLAY "MEDIA FINAL " WRK-MEDIA.

            IF WRK-MEDIA GREATER THAN OR EQUAL 7
            DISPLAY "APROVADO"
           ELSE
            DISPLAY "NOVA PROVA"
           END-IF.

            STOP RUN.
